<?php
echo <<<EOD
[[
		"策略集ID",
		"策略集名称",
		"策略集类型",
		"是否启用",
		"生效时间",
		"失效时间",
		"创建人",
		"创建时间",
		"修改人",
		"修改时间",
		"策略集状态",
		"操作来源",[
			"策略",[
				"策略1",[
					"策略ID",
					"策略名称",
					"策略类型",
					"创建人",
					"创建时间",
					"开始时间",
					"结束时间",
					"启用标志",
					"修改人",
					"修改时间",[
						"规则",[
							"规则1",[
								"策略ID",
								"策略名称",
								"策略类型",
								"创建人",
								"创建时间",
								"开始时间",
								"结束时间",
								"启用标志",
								"修改人",
								"修改时间"
							]
						]
					]
				]
			],[
				"策略2",[
					"策略ID",
					"策略名称",
					"策略类型",
					"创建人",
					"创建时间",
					"开始时间",
					"结束时间",
					"启用标志",
					"修改人",
					"修改时间",[
						"规则",[
							"规则1",[
								"策略ID",
								"策略名称",
								"策略类型",
								"创建人",
								"创建时间",
								"开始时间",
								"结束时间",
								"启用标志",
								"修改人",
								"修改时间"
							]
						],[
							"规则2",[
								"策略ID",
								"策略名称",
								"策略类型",
								"创建人",
								"创建时间",
								"开始时间",
								"结束时间",
								"启用标志",
								"修改人",
								"修改时间"
							]
						]
					]
				]
			],[
				"策略3",[
					"策略ID",
					"策略名称",
					"策略类型",
					"创建人",
					"创建时间",
					"开始时间",
					"结束时间",
					"启用标志",
					"修改人",
					"修改时间",[
						"规则",[
							"规则1",[
								"策略ID",
								"策略名称",
								"策略类型",
								"创建人",
								"创建时间",
								"开始时间",
								"结束时间",
								"启用标志",
								"修改人",
								"修改时间"
							]
						],[
							"规则2",[
								"策略ID",
								"策略名称",
								"策略类型",
								"创建人",
								"创建时间",
								"开始时间",
								"结束时间",
								"启用标志",
								"修改人",
								"修改时间"
							]
						]
					]
				]
			]
		]
	],{
		"修改人":1,
		"策略集ID":"PN2012040104",
		"失效时间":"2012-04-01 03:04:54",
		"策略集类型":"非默认策略集",
		"创建时间":"2012-04-01 03:05:05",
		"操作来源":"手动添加",
		"策略集状态":"活跃策略集",
		"生效时间":"2012-04-01 03:04:52",
		"创建人":1,
		"修改时间":"2012-04-07 02:38:02",
		"策略":{
			"策略3":{
				"修改时间":"2012-04-04 07:47:53",
				"策略ID":"PN2012040104020224",
				"修改人":1,
				"启用标志":"停用",
				"创建时间":"2012-04-04 07:47:53",
				"开始时间":"2012-04-04 07:47:53",
				"结束时间":"2012-04-04 07:47:53",
				"策略类型":"活跃策略集",
				"规则":{
					"规则2":{
						"修改人":1,
						"时间片":null,
						"创建时间":"2012-04-04 07:38:36",
						"阈值1":null,
						"处理方式2":0,
						"处理方式3":null,
						"阈值3":null,
						"规则名称":"行为规则",
						"处理方式1":0,
						"阈值2":null,
						"创建人":1,
						"行为分析模型":1,
						"规则类型":"行为拦截规则",
						"修改时间":"2012-04-04 07:38:36",
						"启用标志":"启用",
						"消息业务类型":"点到点",
						"关键字组":null
					},
					"规则1":{
						"修改人":1,
						"时间片":1,
						"创建时间":"2012-03-29 06:55:47",
						"阈值1":1,
						"处理方式2":1,
						"处理方式3":1,
						"阈值3":2,
						"规则名称":"内容规则1",
						"处理方式1":0,
						"阈值2":2,
						"创建人":1,
						"行为分析模型":null,
						"规则类型":"内容拦截规则",
						"修改时间":"2012-04-01 03:08:08",
						"启用标志":"启用",
						"消息业务类型":"点到点",
						"关键字组":null
					}
				},
				"策略名称":"44444444",
				"创建人":1
			},
			"策略2":{
				"修改时间":"2012-04-04 02:48:15",
				"策略ID":"PN2012040104020222",
				"修改人":1,
				"启用标志":"停用",
				"创建时间":"2012-04-04 02:48:15",
				"开始时间":"2012-04-04 02:48:15",
				"结束时间":"2012-04-04 02:48:15",
				"策略类型":"活跃策略集",
				"规则":{
					"规则1":{
						"修改人":1,
						"时间片":12,
						"创建时间":"2012-04-03 02:26:04",
						"阈值1":12,
						"处理方式2":1,
						"处理方式3":0,
						"阈值3":12,
						"规则名称":"test",
						"处理方式1":1,
						"阈值2":12,
						"创建人":1,
						"行为分析模型":null,
						"规则类型":"内容拦截规则",
						"修改时间":"2012-04-03 02:26:04",
						"启用标志":"启用",
						"消息业务类型":"点到点",
						"关键字组":null
					}
				},
				"策略名称":"123",
				"创建人":1
			},
			"策略1":{
				"修改时间":"2012-04-03 07:00:45",
				"策略ID":"PN2012040104010203",
				"修改人":1,
				"启用标志":"启用",
				"创建时间":"2012-04-01 03:05:05",
				"开始时间":"2012-04-03 07:00:45",
				"结束时间":"2012-04-03 07:00:45",
				"策略类型":"预备策略集",
				"规则":{
					"规则1":{
						"修改人":1,
						"时间片":12,
						"创建时间":"2012-04-03 02:26:04",
						"阈值1":12,
						"处理方式2":1,
						"处理方式3":0,
						"阈值3":12,
						"规则名称":"test",
						"处理方式1":1,
						"阈值2":12,
						"创建人":1,
						"行为分析模型":null,
						"规则类型":"内容拦截规则",
						"修改时间":"2012-04-03 02:26:04",
						"启用标志":"启用",
						"消息业务类型":"点到点",
						"关键字组":null
					}
				},
				"策略名称":"11111111",
				"创建人":1
			}
		},
		"策略集名称":"策略集11",
		"是否启用":"启用"
	},{
		"修改人":1,
		"策略集ID":"PN2012040105",
		"失效时间":"2012-04-01 03:05:19",
		"策略集类型":"非默认策略集",
		"创建时间":"2012-04-01 03:05:28",
		"操作来源":"手动添加",
		"策略集状态":"活跃策略集",
		"生效时间":"2012-04-01 03:05:18",
		"创建人":1,
		"修改时间":"2012-04-01 07:52:06",
		"策略":{
			"策略2":{
				"修改时间":"2012-04-04 02:54:50",
				"策略ID":"PN2012040105020223",
				"修改人":1,
				"启用标志":"启用",
				"创建时间":"2012-04-04 02:54:50",
				"开始时间":"2012-04-04 02:54:50",
				"结束时间":"2012-04-04 02:54:50",
				"策略类型":"活跃策略集",
				"规则":{
					"规则2":{
						"修改人":1,
						"时间片":23,
						"创建时间":"2012-04-04 06:02:54",
						"阈值1":2,
						"处理方式2":0,
						"处理方式3":0,
						"阈值3":2,
						"规则名称":"13",
						"处理方式1":0,
						"阈值2":2,
						"创建人":1,
						"行为分析模型":null,
						"规则类型":"内容拦截规则",
						"修改时间":"2012-04-04 06:02:54",
						"启用标志":"启用",
						"消息业务类型":"点到点",
						"关键字组":null
					},
					"规则1":{
						"修改人":1,
						"时间片":12,
						"创建时间":"2012-04-03 02:26:04",
						"阈值1":12,
						"处理方式2":1,
						"处理方式3":0,
						"阈值3":12,
						"规则名称":"test",
						"处理方式1":1,
						"阈值2":12,
						"创建人":1,
						"行为分析模型":null,
						"规则类型":"内容拦截规则",
						"修改时间":"2012-04-03 02:26:04",
						"启用标志":"启用",
						"消息业务类型":"点到点",
						"关键字组":null
					}
				},
				"策略名称":"11111",
				"创建人":1
			},
			"策略1":{
				"修改时间":"2012-04-03 07:01:42",
				"策略ID":"PN2012040105010204",
				"修改人":1,
				"启用标志":"启用",
				"创建时间":"2012-04-01 03:05:28",
				"开始时间":"2012-04-03 07:01:42",
				"结束时间":"2012-04-03 07:01:42",
				"策略类型":"预备策略集",
				"规则":{
					"规则1":{
						"修改人":1,
						"时间片":12,
						"创建时间":"2012-04-03 02:26:04",
						"阈值1":12,
						"处理方式2":1,
						"处理方式3":0,
						"阈值3":12,
						"规则名称":"test",
						"处理方式1":1,
						"阈值2":12,
						"创建人":1,
						"行为分析模型":null,
						"规则类型":"内容拦截规则",
						"修改时间":"2012-04-03 02:26:04",
						"启用标志":"启用",
						"消息业务类型":"点到点",
						"关键字组":null
					}
				},
				"策略名称":"4444",
				"创建人":1
			}
		},
		"策略集名称":"策略集12",
		"是否启用":"启用"
	}
]
EOD;
?>
