<?php
echo <<<EOD
[[
		"策略集ID",
		"策略集名称",
		"策略集类型",
		"是否启用",
		"生效时间",
		"失效时间",
		"创建人",
		"创建时间",
		"修改人",
		"修改时间",
		"策略集状态",
		"操作来源",[
			"策略",[
				"策略1",[
					"策略ID",
					"策略名称",
					"策略类型",
					"创建人",
					"创建时间",
					"开始时间",
					"结束时间",
					"启用标志",
					"修改人",
					"修改时间",[
						"规则",[
							"规则1",[
								"策略ID",
								"策略名称",
								"策略类型",
								"创建人",
								"创建时间",
								"开始时间",
								"结束时间",
								"启用标志",
								"修改人",
								"修改时间",[
									"关键字组",[
										"关键字组1",[
											"分组名称",
											"备注",[
												"关键字",[
													"关键字1",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												],[
													"关键字2",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												],[
													"关键字3",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												],[
													"关键字4",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												],[
													"关键字5",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												],[
													"关键字6",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												],[
													"关键字7",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												]
											]
										]
									]
								]
							]
						],[
							"规则2",[
								"策略ID",
								"策略名称",
								"策略类型",
								"创建人",
								"创建时间",
								"开始时间",
								"结束时间",
								"启用标志",
								"修改人",
								"修改时间",[
									"关键字组",[
										"关键字组1",[
											"分组名称",
											"备注",[
												"关键字",[
													"关键字1",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												],[
													"关键字2",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												],[
													"关键字3",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												],[
													"关键字4",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												],[
													"关键字5",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												],[
													"关键字6",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												],[
													"关键字7",[
														"关键字内容",
														"语义类别",
														"关键字类型",
														"是否启用",
														"生效时间",
														"失效时间",
														"操作员",
														"操作时间",
														"加入方式",
														"关键字分组",
														"信令标志",
														"添加原因"
													]
												]
											]
										]
									]
								]
							]
						]
					]
				]
			]
		],[
			"监控时段",[
				"监控时段1",[
					"监控时段名称",
					"状态",
					"监控类型",
					"开始时间",
					"结束时间",
					"加权值"
				]
			],[
				"监控时段2",[
					"监控时段名称",
					"状态",
					"监控类型",
					"开始时间",
					"结束时间",
					"加权值"
				]
			]
		]
	],{
		"修改人":"系统管理员",
		"策略集ID":"PS2012041978",
		"失效时间":"2012-03-23 00:00:00",
		"监控时段":{
			"监控时段2":{
				"加权值":5,
				"状态":"启用",
				"结束时间":"1970-01-01 14:45:55",
				"开始时间":"1970-01-01 12:41:53",
				"监控时段名称":"3333",
				"监控类型":"按小时"
			},
			"监控时段1":{
				"加权值":6,
				"状态":"启用",
				"结束时间":"1970-01-01 01:42:27",
				"开始时间":"1970-01-01 00:42:25",
				"监控时段名称":"突然",
				"监控类型":"按小时"
			}
		},
		"策略集类型":"非默认策略集",
		"创建时间":"2012-04-21 15:48:38",
		"操作来源":"导入添加",
		"策略集状态":"预备策略集",
		"生效时间":"2012-03-22 00:00:00",
		"创建人":"系统管理员",
		"修改时间":"2012-04-21 16:49:58",
		"策略":{
			"策略1":{
				"修改时间":"2012-04-14 00:00:00",
				"策略ID":"PS2012041978010009",
				"修改人":"",
				"启用标志":"启用",
				"创建时间":"2012-04-21 15:48:39",
				"开始时间":"2012-03-22 00:00:00",
				"结束时间":"2012-03-23 00:00:00",
				"策略类型":"关键字策略",
				"规则":{
					"规则2":{
						"修改人":"系统管理员",
						"时间片":12,
						"创建时间":"2012-04-21 15:48:39",
						"阈值1":1,
						"处理方式2":0,
						"处理方式3":0,
						"阈值3":1,
						"规则名称":"150",
						"处理方式1":0,
						"阈值2":1,
						"创建人":"系统管理员",
						"行为分析模型":null,
						"规则类型":"内容拦截规则",
						"修改时间":"2012-04-21 15:48:39",
						"启用标志":"启用",
						"消息业务类型":"点到点",
						"关键字组":{
							"关键字组1":{
								"分组名称":"特特 ",
								"关键字":{
									"关键字3":{
										"关键字内容":"癮粔义爒?悬戸",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"其他",
										"失效时间":"2029-01-01 00:00:00",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 16:42:19",
										"关键字分组":"特特 ",
										"添加原因":"士大夫"
									},
									"关键字2":{
										"关键字内容":"555",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"其他",
										"失效时间":"2029-01-01 00:00:00",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 16:18:26",
										"关键字分组":"特特 ",
										"添加原因":null
									},
									"关键字1":{
										"关键字内容":"庁胠乃",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"涉黄",
										"失效时间":"2029-01-01 00:00:00",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 16:41:56",
										"关键字分组":"特特 ",
										"添加原因":null
									},
									"关键字7":{
										"关键字内容":"03254769810325476981032547698103254769810325476981032547698103254769810325476981032547698103254769810325476981032547698103254769810325476981",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"其他",
										"失效时间":"2029-01-01 00:00:00",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 16:25:16",
										"关键字分组":"特特 ",
										"添加原因":null
									},
									"关键字6":{
										"关键字内容":"鍂教?",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"其他",
										"失效时间":"2029-01-01 00:00:00",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 16:47:34",
										"关键字分组":"特特 ",
										"添加原因":null
									},
									"关键字5":{
										"关键字内容":"?鉓睌?畷?店聛龆?矝",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"其他",
										"失效时间":"2029-01-01 00:00:00",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 16:19:36",
										"关键字分组":"特特 ",
										"添加原因":null
									},
									"关键字4":{
										"关键字内容":")犈痮榐(",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"其他",
										"失效时间":"2012-04-21 15:48:39",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 15:48:39",
										"关键字分组":"特特 ",
										"添加原因":null
									}
								},
								"备注":null
							}
						}
					},
					"规则1":{
						"修改人":"系统管理员",
						"时间片":60,
						"创建时间":"2012-04-21 15:48:39",
						"阈值1":3,
						"处理方式2":0,
						"处理方式3":0,
						"阈值3":1,
						"规则名称":"1497887",
						"处理方式1":0,
						"阈值2":2,
						"创建人":"系统管理员",
						"行为分析模型":null,
						"规则类型":"内容拦截规则",
						"修改时间":"2012-04-21 16:00:07",
						"启用标志":"启用",
						"消息业务类型":"点到点",
						"关键字组":{
							"关键字组1":{
								"分组名称":"特特 ",
								"关键字":{
									"关键字3":{
										"关键字内容":"癮粔义爒?悬戸",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"其他",
										"失效时间":"2029-01-01 00:00:00",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 16:42:19",
										"关键字分组":"特特 ",
										"添加原因":"士大夫"
									},
									"关键字2":{
										"关键字内容":"555",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"其他",
										"失效时间":"2029-01-01 00:00:00",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 16:18:26",
										"关键字分组":"特特 ",
										"添加原因":null
									},
									"关键字1":{
										"关键字内容":"庁胠乃",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"涉黄",
										"失效时间":"2029-01-01 00:00:00",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 16:41:56",
										"关键字分组":"特特 ",
										"添加原因":null
									},
									"关键字7":{
										"关键字内容":"03254769810325476981032547698103254769810325476981032547698103254769810325476981032547698103254769810325476981032547698103254769810325476981",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"其他",
										"失效时间":"2029-01-01 00:00:00",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 16:25:16",
										"关键字分组":"特特 ",
										"添加原因":null
									},
									"关键字6":{
										"关键字内容":"鍂教?",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"其他",
										"失效时间":"2029-01-01 00:00:00",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 16:47:34",
										"关键字分组":"特特 ",
										"添加原因":null
									},
									"关键字5":{
										"关键字内容":"?鉓睌?畷?店聛龆?矝",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"其他",
										"失效时间":"2029-01-01 00:00:00",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 16:19:36",
										"关键字分组":"特特 ",
										"添加原因":null
									},
									"关键字4":{
										"关键字内容":")犈痮榐(",
										"关键字类型":"一般关键字",
										"加入方式":"手动",
										"语义类别":"其他",
										"失效时间":"2012-04-21 15:48:39",
										"操作时间":"",
										"信令标志":1,
										"是否启用":"启用",
										"操作员":"系统管理员",
										"生效时间":"2012-04-21 15:48:39",
										"关键字分组":"特特 ",
										"添加原因":null
									}
								},
								"备注":null
							}
						}
					}
				},
				"策略名称":"PS2012041978010009",
				"创建人":"系统管理员"
			}
		},
		"策略集名称":"哈哈22222哈哈6666666666",
		"是否启用":"启用"
	},
	null
]
EOD;
?>
