<?php
		echo <<<EOD
[
	[
		"策略集ID",
		"修改人",
		"创建时间",
		"失效时间",
		"策略集类型",
		[
			"策略",
			[
				"策略ID",
				"修改人",
				"创建时间",
				"结束时间",
				"策略类型",
				[
					"规则",
					[
						"规则名称",
						"规则类型",
						"阈值1",
						"阈值2",
						"阈值3"
					]
				]
			]
		]
	],
	{
		"修改人":1,
		"策略集ID":"PN2012040104",
		"失效时间":"2012-04-01 03:04:54",
		"策略集类型":"非默认策略集",
		"创建时间":"2012-04-01 03:05:05",
		"操作来源":"手动添加",
		"策略集状态":"预备策略集",
		"生效时间":"2012-04-01 03:04:52",
		"创建人":1,
		"修改时间":"2012-04-01 07:16:20",
		"策略":[{
			"修改时间":"2012-04-04 02:48:15",
			"策略ID":"PN2012040104020222",
			"修改人":1,
			"启用标志":"停用",
			"创建时间":"2012-04-04 02:48:15",
			"开始时间":"2012-04-04 02:48:15",
			"结束时间":"2012-04-04 02:48:15",
			"策略类型":"活跃策略集",
			"规则":[{
				"修改人":1,
				"时间片":12,
				"创建时间":"2012-04-03 02:26:04",
				"阈值1":12,
				"处理方式2":1,
				"处理方式3":0,
				"阈值3":12,
				"规则名称":"test",
				"处理方式1":1,
				"阈值2":12,
				"创建人":1,
				"行为分析模型":null,
				"规则类型":"内容拦截规则",
				"修改时间":"2012-04-03 02:26:04",
				"启用标志":"启用",
				"消息业务类型":"点到点",
				"关键字组":null
			}],
			"策略名称":"123",
			"创建人":1
		}],
		"策略集名称":"策略集11",
		"是否启用":"启用"
	},
	{
		"修改人":1,
		"策略集ID":"PN2012040105",
		"失效时间":"2012-04-01 03:05:19",
		"策略集类型":"非默认策略集",
		"创建时间":"2012-04-01 03:05:28",
		"操作来源":"手动添加",
		"策略集状态":"预备策略集",
		"生效时间":"2012-04-01 03:05:18",
		"创建人":1,
		"修改时间":"2012-04-01 07:52:06",
		"策略":[{
			"修改时间":"2012-04-03 07:01:42",
			"策略ID":"PN2012040105010204",
			"修改人":1,
			"启用标志":"启用",
			"创建时间":"2012-04-01 03:05:28",
			"开始时间":"2012-04-03 07:01:42",
			"结束时间":"2012-04-03 07:01:42",
			"策略类型":"预备策略集",
			"规则":[{
				"修改人":1,
				"时间片":12,
				"创建时间":"2012-04-03 02:26:04",
				"阈值1":12,
				"处理方式2":1,
				"处理方式3":0,
				"阈值3":12,
				"规则名称":"test",
				"处理方式1":1,
				"阈值2":12,
				"创建人":1,
				"行为分析模型":null,
				"规则类型":"内容拦截规则",
				"修改时间":"2012-04-03 02:26:04",
				"启用标志":"启用",
				"消息业务类型":"点到点",
				"关键字组":null
			}],
			"策略名称":"4444",
			"创建人":1
		}],
		"策略集名称":"策略集12",
		"是否启用":"启用"
	}
]
EOD;
?>
