/**
 * 预定义规则
 */

define(['./rule'], function(Rule){

	//必填
	//默认正则都可为空,不能为空请加上must规则
	Rule.add('must', /^.+$/, '此项必填');

	//不带前置0的ipv4, 如: 10.2.100.11
	Rule.add(
		'ipv4',
		/^$|^(25[0-5]|2[0-4]\d|1\d{2}|[1-9]?\d)\.(25[0-5]|2[0-4]\d|1\d{2}|[1-9]?\d)\.(25[0-5]|2[0-4]\d|1\d{2}|[1-9]?\d)\.(25[0-5]|2[0-4]\d|1\d{2}|[1-9]?\d)$/,
		'IPv4,点分十进制共四位,每个数字不能超过255'
	);

	//可带前置0的ipv4, 如: 010.002.100.011
	Rule.add(
		'ipv4-prefix0',
		/^$|^(25[0-5]|2[0-4]\d|[01]\d{2}|\d?\d)\.(25[0-5]|2[0-4]\d|[01]\d{2}|\d?\d)\.(25[0-5]|2[0-4]\d|[01]\d{2}|\d?\d)\.(25[0-5]|2[0-4]\d|[01]\d{2}|\d?\d)$/,
		'IPv4,点分十进制,共四位,每个数字不能超过255,可有前置0'
	);


	//此段保留在最底部,如果有JS国际化信息将进行覆盖
	//国际化key命名规则为: js.common.Rule.规则名, 如: js.common.Rule.ipv4
	if(window.JS_I18N){
		S.each(items, function(v, i, o){
			Rule.setDesc(i, JS_I18N['js.common.Rule.' + i]);
		});
	}

	return Rule;
});
